Revit 2024 API
EvaluatedParameter Members
The EvaluatedParameter type exposes the following members.
Methods
Name | Description
AsValueString(Document)
 Get the parameter value as a string with units.
AsValueString(Document, FormatOptions)
 Get the parameter value as a string with units.
Dispose
Releases all resources used by the EvaluatedParameter
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Definition
 Definition of the parameter.
HasValue
 This property is true when the parameter value was successfully obtained, false otherwise.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
StorageType
 The storage type describes the type that is used internally within the parameter to store its value.
Value
 Evaluated value of the parameter.
See Also
EvaluatedParameter Class
Autodesk.Revit.DB Namespace